[
  {
    "id": "spec-store-1",
    "category": "Data Model",
    "description": "Update Specification type with order field. Each specification must have id, name, order (number), and values array. SpecValue must have id, displayValue, and skuFragment.",
    "stepsToVerify": [
      "src/types/index.ts contains Specification interface with order: number field",
      "src/types/index.ts contains SpecValue interface with id, displayValue, skuFragment fields",
      "TypeScript compiles without errors: npm run typecheck"
    ],
    "passes": true
  },
  {
    "id": "spec-store-2",
    "category": "Data Model",
    "description": "Revive useSpecificationsStore as the single source of truth for specifications. Remove deprecated status. Add reorderSpec(specId, newOrder) action. Add CRUD operations that maintain order consistency.",
    "stepsToVerify": [
      "src/store/specifications.ts exports useSpecificationsStore with addSpecification, updateSpecification, removeSpecification, reorderSpec actions",
      "reorderSpec updates the order field and adjusts other specs' orders accordingly",
      "Store persists to localStorage with key 'sku-specifications'",
      "npm run test passes for specification store tests"
    ],
    "passes": true
  },
  {
    "id": "spec-store-3",
    "category": "Data Model",
    "description": "Add skuFragment uniqueness validation to specifications store. skuFragment must be unique within its specification (not globally).",
    "stepsToVerify": [
      "Store has validateSkuFragment(specId, skuFragment) selector that returns boolean",
      "Adding a value with duplicate skuFragment within same spec is prevented or returns error",
      "Different specs can have same skuFragment (e.g., Color:R and Size:R is allowed)"
    ],
    "passes": true
  },
  {
    "id": "remove-config-1",
    "category": "Remove Config Sheet",
    "description": "Remove Config sheet creation from initialization. Only data sheets should be created on first launch.",
    "stepsToVerify": [
      "initializeWithSampleData() in src/store/sheets.ts does not create Config sheet",
      "Sample specifications are added to useSpecificationsStore instead",
      "Fresh app load shows only data sheet(s), no Config tab"
    ],
    "passes": true
  },
  {
    "id": "remove-config-2",
    "category": "Remove Config Sheet",
    "description": "Remove all Config sheet handling from SpreadsheetContainer. Remove parseConfigSheet usage, Config sheet type checks, and Config sheet protection logic.",
    "stepsToVerify": [
      "src/components/SpreadsheetContainer.tsx has no imports from config-sheet.ts",
      "No references to sheet.type === 'config' in SpreadsheetContainer",
      "App renders without errors when Config sheet doesn't exist"
    ],
    "passes": true
  },
  {
    "id": "remove-config-3",
    "category": "Remove Config Sheet",
    "description": "Update dropdown building to use specifications store instead of Config sheet. Dropdowns should show displayValue options from each specification.",
    "stepsToVerify": [
      "SpreadsheetContainer reads from useSpecificationsStore for dropdown values",
      "Dropdown options match specification values from store",
      "Adding a new spec value immediately appears in column dropdowns"
    ],
    "passes": true
  },
  {
    "id": "sidebar-ui-1",
    "category": "Specification Management UI",
    "description": "Enhance SpecificationList to read from useSpecificationsStore instead of parsing Config sheet. Display specs sorted by order field.",
    "stepsToVerify": [
      "SpecificationList uses useSpecificationsStore hook",
      "Specs display in order of their order field (lowest first)",
      "Each spec shows name, value count, and individual values with skuFragments"
    ],
    "passes": true
  },
  {
    "id": "sidebar-ui-2",
    "category": "Specification Management UI",
    "description": "Add drag-and-drop reordering to SpecificationList. When user drags a spec to a new position, update order field and regenerate all SKUs.",
    "stepsToVerify": [
      "Spec items can be dragged and dropped to reorder",
      "After reorder, spec order fields are updated in store",
      "After reorder, all SKUs in all data sheets are regenerated",
      "Order persists after page reload"
    ],
    "passes": true
  },
  {
    "id": "sidebar-ui-3",
    "category": "Specification Management UI",
    "description": "Add inline editing for specification values in sidebar. Users can edit displayValue and skuFragment directly. Show validation error if skuFragment is not unique within spec.",
    "stepsToVerify": [
      "Click on a value shows edit inputs for displayValue and skuFragment",
      "Changing skuFragment triggers validation",
      "Duplicate skuFragment within same spec shows error message",
      "Valid changes save to store and update affected SKUs"
    ],
    "passes": false
  },
  {
    "id": "sidebar-ui-4",
    "category": "Specification Management UI",
    "description": "Update AddSpecDialog to work with specifications store. Add order field (defaults to max existing order + 1).",
    "stepsToVerify": [
      "AddSpecDialog writes new specifications to useSpecificationsStore",
      "New specs get order = max existing order + 1",
      "New spec appears at bottom of sidebar list",
      "New spec column appears in data sheets with dropdown"
    ],
    "passes": true
  },
  {
    "id": "sku-gen-1",
    "category": "SKU Generation",
    "description": "Modify generateRowSKU to accept Specification[] from store and sort by order field before concatenating skuFragments. Column order in data sheet should not affect SKU composition.",
    "stepsToVerify": [
      "generateRowSKU accepts Specification[] parameter",
      "Specs are sorted by order field before building SKU",
      "SKU is built as: prefix + fragments.join(delimiter) + suffix",
      "Reordering columns in data sheet does not change SKU"
    ],
    "passes": true
  },
  {
    "id": "sku-gen-2",
    "category": "SKU Generation",
    "description": "Update auto-SKU logic to use specifications from store. When any cell changes in a data row, regenerate that row's SKU.",
    "stepsToVerify": [
      "processAutoSKU reads specifications from useSpecificationsStore",
      "Changing a value in data sheet updates SKU in column 0",
      "SKU uses skuFragments from store, sorted by spec order"
    ],
    "passes": true
  },
  {
    "id": "readonly-sku-1",
    "category": "Read-Only SKU Column",
    "description": "Make SKU column (column 0) read-only in data sheets. Users should not be able to manually edit SKU values.",
    "stepsToVerify": [
      "Clicking on SKU cell does not allow text input",
      "Double-clicking SKU cell does not enable edit mode",
      "Copy from SKU cell still works",
      "Auto-generated SKU values still update correctly"
    ],
    "passes": true
  },
  {
    "id": "readonly-sku-2",
    "category": "Read-Only SKU Column",
    "description": "Add visual styling to indicate SKU column is read-only. Use subtle background color or other visual indicator.",
    "stepsToVerify": [
      "SKU column has visually distinct appearance from editable columns",
      "Styling clearly indicates the column is auto-generated"
    ],
    "passes": false
  },
  {
    "id": "validation-1",
    "category": "Validation",
    "description": "Create validation module to detect deleted values. When a cell contains a displayValue that no longer exists in its specification, mark it as an error.",
    "stepsToVerify": [
      "src/lib/validation.ts exports validateDataSheet function",
      "Deleting a spec value from sidebar marks affected cells as errors",
      "Error includes row, column, and message about missing value"
    ],
    "passes": false
  },
  {
    "id": "validation-2",
    "category": "Validation",
    "description": "Add duplicate SKU detection. When multiple rows have the same SKU value, show a warning.",
    "stepsToVerify": [
      "Validation detects when 2+ rows have identical SKU",
      "Warning includes which rows have duplicates",
      "Duplicate SKUs are highlighted in the spreadsheet"
    ],
    "passes": false
  },
  {
    "id": "validation-3",
    "category": "Validation",
    "description": "Create ValidationPanel component to display validation errors below the spreadsheet. Errors should be clickable to jump to the affected cell.",
    "stepsToVerify": [
      "ValidationPanel appears below spreadsheet when errors exist",
      "Panel shows count and list of errors",
      "Clicking an error scrolls to and selects the affected cell",
      "Panel hides when no errors exist"
    ],
    "passes": false
  },
  {
    "id": "reactivity-1",
    "category": "Reactivity",
    "description": "When a skuFragment changes in the specifications store, automatically regenerate all affected SKUs in all data sheets.",
    "stepsToVerify": [
      "Edit skuFragment in sidebar",
      "All rows using that value have their SKU regenerated",
      "Changes reflect immediately without manual refresh"
    ],
    "passes": true
  },
  {
    "id": "reactivity-2",
    "category": "Reactivity",
    "description": "When specification order changes (via drag-and-drop), regenerate all SKUs in all data sheets to reflect new composition order.",
    "stepsToVerify": [
      "Drag spec A above spec B in sidebar",
      "All SKUs now have spec A's fragment before spec B's fragment",
      "Example: Color(order:1), Size(order:2) with Red=R, Small=S produces R-S"
    ],
    "passes": false
  },
  {
    "id": "reactivity-3",
    "category": "Reactivity",
    "description": "When a displayValue is renamed in specifications store, update all cells showing that value to show the new name. SKUs should remain unchanged (only displayValue changes, not skuFragment).",
    "stepsToVerify": [
      "Rename 'Red' to 'Crimson' in sidebar",
      "All cells showing 'Red' now show 'Crimson'",
      "SKUs remain unchanged (still use skuFragment 'R')"
    ],
    "passes": false
  },
  {
    "id": "cleanup-1",
    "category": "Cleanup",
    "description": "Remove or deprecate config-sheet.ts and related utilities that are no longer needed after Config sheet removal.",
    "stepsToVerify": [
      "src/lib/config-sheet.ts is deleted or clearly marked deprecated",
      "No active imports of parseConfigSheet in codebase",
      "npm run build succeeds without config-sheet dependencies"
    ],
    "passes": false
  },
  {
    "id": "migration-1",
    "category": "Migration",
    "description": "Add migration logic for existing users who have Config sheet data. On app load, if Config sheet exists, migrate specs to store format and remove Config sheet.",
    "stepsToVerify": [
      "User with existing Config sheet data loads app",
      "Specs from Config sheet are imported to specifications store",
      "Config sheet is removed after successful migration",
      "Data sheets remain intact with correct values"
    ],
    "passes": false
  }
]
