[
  {
    "id": "migration-spreadsheet-types",
    "category": "Spreadsheet Migration",
    "description": "Create extended cell type for react-spreadsheet. Define SKUCell interface extending CellBase with value, readOnly, className, and dropdownOptions fields. Create SKUMatrix type alias for 2D array of SKUCell.",
    "stepsToVerify": [
      "src/types/spreadsheet.ts exists with SKUCell interface",
      "SKUCell has: value (string|number|null), readOnly (boolean), className (string), dropdownOptions (string[])",
      "SKUMatrix type is exported as (SKUCell | null)[][]",
      "npm run typecheck passes"
    ],
    "passes": true
  },
  {
    "id": "migration-spreadsheet-adapter",
    "category": "Spreadsheet Migration",
    "description": "Create data conversion utilities for react-spreadsheet. Implement convertToSpreadsheetData() to transform CellData[][] to SKUMatrix with readOnly flags on SKU column and dropdownOptions on spec columns. Implement convertFromSpreadsheetData() to transform back.",
    "stepsToVerify": [
      "src/lib/spreadsheet-adapter.ts exports convertToSpreadsheetData and convertFromSpreadsheetData",
      "convertToSpreadsheetData sets readOnly: true on col 0 cells (except row 0 header)",
      "convertToSpreadsheetData populates dropdownOptions from specifications for spec columns",
      "convertFromSpreadsheetData converts SKUMatrix back to CellData[][]",
      "npm run typecheck passes"
    ],
    "passes": true
  },
  {
    "id": "migration-dropdown-editor",
    "category": "Spreadsheet Migration",
    "description": "Create custom DataEditor component for dropdown selection in spec columns. When cell has dropdownOptions, render <select> with options. When no dropdownOptions, render text input. Handle keyboard events (Enter, Tab, Escape) for UX.",
    "stepsToVerify": [
      "src/components/spreadsheet/DropdownEditor.tsx exports DropdownEditor component",
      "Component renders <select> when cell.dropdownOptions exists and has values",
      "Component renders <input type='text'> as fallback when no dropdown options",
      "Keyboard: Enter/Tab commits and exits edit, Escape cancels",
      "Select auto-focuses on mount"
    ],
    "passes": true
  },
  {
    "id": "migration-sheet-tabs",
    "category": "Spreadsheet Migration",
    "description": "Create custom SheetTabs component for multi-sheet navigation. Support tab switching (click), tab renaming (double-click), tab deletion (X button with confirmation), and add new sheet (+ button). Style active tab distinctly.",
    "stepsToVerify": [
      "src/components/spreadsheet/SheetTabs.tsx exports SheetTabs component",
      "Click on tab calls onActivate with sheet id",
      "Double-click enables inline rename input",
      "Rename commits on Enter/blur, cancels on Escape",
      "X button calls onDelete (visible only when multiple sheets exist)",
      "+ button calls onAdd",
      "Active tab has distinct styling (border/background)"
    ],
    "passes": true
  },
  {
    "id": "migration-toolbar",
    "category": "Spreadsheet Migration",
    "description": "Create SpreadsheetToolbar component with basic actions. Include Undo/Redo buttons, Import button (opens file picker for Excel/CSV), Export dropdown (Excel/CSV options), and Add Row button.",
    "stepsToVerify": [
      "src/components/spreadsheet/SpreadsheetToolbar.tsx exports SpreadsheetToolbar component",
      "Undo button reverts last change (or is disabled when nothing to undo)",
      "Redo button re-applies undone change (or is disabled when nothing to redo)",
      "Import button triggers file input for .xlsx/.csv files",
      "Export offers Excel and CSV download options",
      "Add Row button appends new empty row to active sheet"
    ],
    "passes": true
  },
  {
    "id": "migration-dependencies",
    "category": "Spreadsheet Migration",
    "description": "Swap spreadsheet library dependencies. Remove @fortune-sheet/react, add react-spreadsheet and scheduler peer dependency.",
    "stepsToVerify": [
      "package.json does not contain @fortune-sheet/react",
      "package.json contains react-spreadsheet",
      "package.json contains scheduler as dependency",
      "npm install completes without errors",
      "npm run build completes without errors"
    ],
    "passes": true
  },
  {
    "id": "migration-container-rewrite",
    "category": "Spreadsheet Migration",
    "description": "Rewrite SpreadsheetContainer to use react-spreadsheet instead of Fortune-Sheet. Integrate custom DropdownEditor, SheetTabs, and SpreadsheetToolbar. Remove Fortune-Sheet imports, hooks, and data conversion. Use new spreadsheet-adapter functions for data transformation.",
    "stepsToVerify": [
      "SpreadsheetContainer imports from 'react-spreadsheet' not '@fortune-sheet/react'",
      "Component renders <Spreadsheet> with data, onChange, DataEditor props",
      "SheetTabs component renders below spreadsheet",
      "SpreadsheetToolbar component renders above spreadsheet",
      "ValidationPanel still renders and functions correctly",
      "npm run typecheck passes"
    ],
    "passes": true
  },
  {
    "id": "migration-readonly-sku",
    "category": "Spreadsheet Migration",
    "description": "Verify SKU column (column A) is read-only in the new react-spreadsheet implementation. Users cannot edit SKU cells except the header. Apply visual styling to indicate read-only status.",
    "stepsToVerify": [
      "Click on SKU cell (row > 0) does not enable editing",
      "SKU column has distinct background color (#f1f5f9 gray-blue)",
      "Header cell (row 0, col 0) IS editable for renaming column",
      "Auto-generated SKU values still update when spec values change"
    ],
    "passes": true
  },
  {
    "id": "migration-dropdowns",
    "category": "Spreadsheet Migration",
    "description": "Verify dropdown selection works in spec columns. When clicking/editing a spec column cell, dropdown appears with specification values. Selecting a value updates the cell and triggers SKU regeneration.",
    "stepsToVerify": [
      "Click/Enter on spec column cell shows dropdown with spec values",
      "Dropdown options match displayValues from specification store",
      "Selecting a value updates cell content",
      "SKU in column A regenerates with new skuFragment",
      "Tab/Enter moves to next cell after selection"
    ],
    "passes": true
  },
  {
    "id": "migration-duplicate-highlight",
    "category": "Spreadsheet Migration",
    "description": "Verify duplicate SKU warning styling works. Rows with duplicate SKU values should have amber background highlighting on the SKU cell.",
    "stepsToVerify": [
      "Create two rows with same spec value combination",
      "Both SKU cells show amber background (#fef3c7)",
      "Changing one row to have different values removes amber from both",
      "Validation panel shows duplicate SKU errors"
    ],
    "passes": true
  },
  {
    "id": "migration-click-navigate",
    "category": "Spreadsheet Migration",
    "description": "Implement click-to-navigate for validation errors. When clicking an error in ValidationPanel, scroll to and select the affected cell in the spreadsheet.",
    "stepsToVerify": [
      "Click on validation error in panel",
      "Spreadsheet scrolls to show the affected cell",
      "Affected cell is selected/highlighted",
      "Works for both missing-value and duplicate-sku error types"
    ],
    "passes": true
  },
  {
    "id": "migration-css-styles",
    "category": "Spreadsheet Migration",
    "description": "Add CSS styles for react-spreadsheet customizations. Style read-only cells, duplicate warning cells, header row, dropdown editor, and toolbar.",
    "stepsToVerify": [
      "src/index.css (or dedicated file) has .sku-spreadsheet styles",
      "Read-only cells have gray-blue background",
      "Duplicate SKU cells have amber background",
      "Header row (first row) has bold text and light background",
      "Dropdown/select has proper focus outline styling",
      "Toolbar buttons have consistent styling with app theme"
    ],
    "passes": true
  },
  {
    "id": "migration-tests-update",
    "category": "Spreadsheet Migration",
    "description": "Update SpreadsheetContainer tests for react-spreadsheet. Mock react-spreadsheet instead of @fortune-sheet/react. Update test assertions for new component structure.",
    "stepsToVerify": [
      "SpreadsheetContainer.test.tsx mocks 'react-spreadsheet' not '@fortune-sheet/react'",
      "Tests verify data transformation works correctly",
      "Tests verify sheet tab interactions",
      "npm run test passes for SpreadsheetContainer tests"
    ],
    "passes": true
  },
  {
    "id": "migration-undo-redo",
    "category": "Spreadsheet Migration",
    "description": "Implement undo/redo functionality for spreadsheet edits. Track change history and allow reverting/reapplying changes via toolbar buttons.",
    "stepsToVerify": [
      "Edit a cell value, click Undo - value reverts to previous",
      "After Undo, click Redo - value returns to edited state",
      "Undo button disabled when no history",
      "Redo button disabled when at latest state",
      "History clears when switching sheets"
    ],
    "passes": true
  },
  {
    "id": "migration-import-export",
    "category": "Spreadsheet Migration",
    "description": "Verify import/export functionality works with new spreadsheet. Toolbar import loads Excel/CSV files, export downloads current sheet data.",
    "stepsToVerify": [
      "Click Import, select .xlsx file - data loads into active sheet",
      "Click Import, select .csv file - data loads into active sheet",
      "Click Export > Excel - downloads .xlsx file with current data",
      "Click Export > CSV - downloads .csv file with current data",
      "Imported data triggers SKU regeneration"
    ],
    "passes": true
  },
  {
    "id": "migration-add-row",
    "category": "Spreadsheet Migration",
    "description": "Implement Add Row functionality in toolbar. Button appends new empty row to active sheet with proper cell structure for spec columns.",
    "stepsToVerify": [
      "Click Add Row button in toolbar",
      "New row appears at bottom of sheet",
      "New row has empty SKU cell and empty spec cells",
      "Spec cells in new row have dropdown functionality",
      "Selecting values in new row generates SKU"
    ],
    "passes": true
  },
  {
    "id": "sheet-local-specifications",
    "category": "Sheet Enhancements",
    "description": "Make specifications local to each sheet instead of global. Each sheet should have its own independent set of specifications. Add ColumnDef interface with id, type ('sku'|'spec'|'free'), specId (optional), and header fields. Update SheetConfig to include columns: ColumnDef[] and specifications: Specification[] arrays. Migrate existing sheets to include copies of global specs.",
    "stepsToVerify": [
      "src/types/index.ts exports ColumnDef interface with id, type, specId?, header fields",
      "SheetConfig interface includes columns: ColumnDef[] and specifications: Specification[]",
      "Creating a new sheet initializes with empty specifications array",
      "Adding a spec to Sheet1 does NOT add it to Sheet2",
      "Switching sheets shows different specifications in sidebar",
      "Existing user data migrates correctly with specs copied to each sheet",
      "npm run typecheck passes"
    ],
    "passes": true
  },
  {
    "id": "sheet-default-rows",
    "category": "Sheet Enhancements",
    "description": "New sheets should be created with 50 empty rows by default and only the SKU column. Modify createEmptySheet() to generate header row plus 50 empty data rows with just the SKU column.",
    "stepsToVerify": [
      "Create a new sheet via + button",
      "New sheet has exactly 51 rows (1 header + 50 data rows)",
      "New sheet has only SKU column initially",
      "Each empty row has an empty cell for the SKU column",
      "User can add spec columns to populate the sheet"
    ],
    "passes": true
  },
  {
    "id": "column-drag-reorder",
    "category": "Column Management",
    "description": "Implement column reordering by dragging column headers in the spreadsheet. Add drag handles or make entire header cell draggable. On drop, reorder the columns array and update all row data accordingly. SKU column (index 0) should not be movable.",
    "stepsToVerify": [
      "Column headers show drag affordance on hover (cursor change or grip icon)",
      "Dragging a column header shows visual feedback (highlight drop zones)",
      "Dropping column at new position reorders columns array in store",
      "All row data shifts to match new column order",
      "SKU column cannot be dragged (stays at position 0)",
      "Undo/redo works for column reorder operations"
    ],
    "passes": true
  },
  {
    "id": "column-types-spec-free",
    "category": "Column Management",
    "description": "Support two column types: spec columns (linked to a specification with dropdown validation) and free columns (plain text input, no SKU contribution). Spec columns reference a specId and render dropdowns. Free columns render as regular text input. Only spec column values contribute to SKU generation.",
    "stepsToVerify": [
      "Can add a 'spec column' that shows dropdown with spec values",
      "Can add a 'free column' that shows plain text input",
      "Free columns have no dropdown options",
      "SKU generation only includes values from spec columns",
      "Free column values do not affect generated SKU",
      "spreadsheet-adapter correctly identifies column types from columns array"
    ],
    "passes": true
  },
  {
    "id": "add-column-dialog",
    "category": "Column Management",
    "description": "Create AddColumnDialog component for inserting columns at any position. Dialog should include: column type selector (Spec/Free), spec selector dropdown (if spec type, with option to create new), column name input (for free columns), and position selector showing 'At end' or 'Before [ColumnName]' options.",
    "stepsToVerify": [
      "src/components/AddColumnDialog.tsx exports AddColumnDialog component",
      "Dialog has column type toggle: 'Specification' vs 'Free'",
      "When Specification selected, shows dropdown of existing specs + 'Create new' option",
      "When Free selected, shows text input for column name",
      "Position dropdown shows all current columns as 'Before X' options plus 'At end'",
      "Submitting adds column at selected position and updates all row data"
    ],
    "passes": true
  },
  {
    "id": "column-context-menu",
    "category": "Column Management",
    "description": "Add right-click context menu on column headers with options: 'Insert column before', 'Insert column after', 'Delete column'. Insert options open AddColumnDialog with position pre-set. Delete shows confirmation for spec columns (warns about data loss).",
    "stepsToVerify": [
      "Right-click on column header shows context menu",
      "Menu has 'Insert column before' option",
      "Menu has 'Insert column after' option",
      "Menu has 'Delete column' option",
      "Insert options open AddColumnDialog with correct position pre-selected",
      "Delete column removes column from columns array and all row data",
      "SKU column context menu does not show delete option"
    ],
    "passes": true
  },
  {
    "id": "delete-spec-confirmation",
    "category": "Specification Management",
    "description": "Create DeleteSpecConfirmDialog component for confirming specification deletion. Show spec name and warn that associated columns will be removed. Add delete button to SpecificationList items. On confirm, remove spec from sheet.specifications and remove all columns that reference that specId.",
    "stepsToVerify": [
      "src/components/DeleteSpecConfirmDialog.tsx exports DeleteSpecConfirmDialog component",
      "Dialog shows spec name being deleted",
      "Dialog warns about associated column removal",
      "Dialog has Cancel and Delete buttons (Delete is destructive styled)",
      "SpecificationList shows delete button/icon for each spec",
      "Clicking delete opens confirmation dialog",
      "Confirming removes spec and all columns with matching specId",
      "Row data updates to remove deleted column cells"
    ],
    "passes": true
  },
  {
    "id": "spec-store-migration",
    "category": "Specification Management",
    "description": "Migrate specification management methods from global useSpecificationsStore to sheet-scoped methods in useSheetsStore. All spec operations (add, update, remove, addValue, updateValue, removeValue) should take sheetId as first parameter. Update SpecificationList and AddSpecDialog to use sheet-scoped methods.",
    "stepsToVerify": [
      "useSheetsStore has addSpecification(sheetId, name) method",
      "useSheetsStore has removeSpecification(sheetId, specId) method",
      "useSheetsStore has addSpecValue(sheetId, specId, displayValue, skuFragment) method",
      "useSheetsStore has updateSpecValue(sheetId, specId, valueId, updates) method",
      "useSheetsStore has removeSpecValue(sheetId, specId, valueId) method",
      "SpecificationList reads specs from activeSheet.specifications",
      "AddSpecDialog uses sheet-scoped addSpecification method",
      "npm run typecheck passes"
    ],
    "passes": true
  },
  {
    "id": "toolbar-add-column-button",
    "category": "UX Improvements",
    "description": "Add discoverable 'Add Column' button to SpreadsheetToolbar. Currently columns can only be added via right-click context menu which is not discoverable. Add button with Columns icon after 'Add Row' button. Wire to existing AddColumnDialog with position set to 'end'.",
    "stepsToVerify": [
      "SpreadsheetToolbar has 'Add Column' button visible after 'Add Row' button",
      "Button has Columns icon from lucide-react",
      "Clicking button opens AddColumnDialog",
      "Dialog defaults to inserting column at end",
      "Can add both spec and free columns via the button",
      "npm run typecheck passes"
    ],
    "passes": true
  },
  {
    "id": "spec-name-editing",
    "category": "UX Improvements",
    "description": "Add ability to edit specification names after creation. Currently spec VALUES can be edited but spec NAMES cannot. Add pencil edit icon button to SpecItem header. When clicked, show inline Input field with Save/Cancel buttons. On save, call updateSpecification() and sync column headers that reference this spec.",
    "stepsToVerify": [
      "SpecItem shows pencil edit icon button next to spec name",
      "Clicking edit icon enters inline edit mode with Input field",
      "Input shows current spec name as initial value",
      "Save button (checkmark) commits the change",
      "Cancel button (X) reverts to original name",
      "Validation prevents empty name or duplicate name",
      "Saving updates spec name in store via updateSpecification()",
      "All columns with specId matching edited spec have their header updated",
      "npm run typecheck passes"
    ],
    "passes": true
  },
  {
    "id": "sheet-tabs-fixed-layout",
    "category": "UX Improvements",
    "description": "Fix SheetTabs position so they stay visible at bottom of viewport regardless of row count. Currently with many rows the tabs get pushed down requiring scroll. Ensure spreadsheet area is the scrollable portion while SheetTabs remains fixed at bottom.",
    "stepsToVerify": [
      "Add 100+ rows to a sheet",
      "SheetTabs remain visible at bottom of viewport without scrolling",
      "Spreadsheet area scrolls internally to show all rows",
      "ValidationPanel also stays visible below SheetTabs",
      "Layout works correctly when sidebar is collapsed or expanded",
      "npm run typecheck passes"
    ],
    "passes": true
  },
  {
    "id": "remove-duplicate-import-export",
    "category": "UX Improvements",
    "description": "Remove duplicate Import/Export buttons from SpreadsheetToolbar. Import/Export functionality exists in both AppLayout header AND SpreadsheetToolbar causing confusion. Remove from toolbar, keep only in header. Toolbar should have: Undo, Redo, Add Row, Add Column.",
    "stepsToVerify": [
      "SpreadsheetToolbar no longer has Import button",
      "SpreadsheetToolbar no longer has Export dropdown",
      "SpreadsheetToolbar has: Undo, Redo, Add Row, Add Column buttons only",
      "AppLayout header still has working Import button",
      "AppLayout header still has working Export dropdown with Excel/CSV options",
      "npm run typecheck passes"
    ],
    "passes": true
  },
  {
    "id": "update-documentation-tour",
    "category": "Documentation",
    "description": "Update GUIDE.md and guided-tour.ts to reflect current app architecture. Remove references to deprecated 'Config sheet' approach. Update Fortune-Sheet selectors to react-spreadsheet selectors. Document new features: Add Column button, spec name editing. Simplify tour to ~15-18 steps focused on current sidebar-based workflow.",
    "stepsToVerify": [
      "GUIDE.md does not reference 'Config sheet' or 'Config tab'",
      "GUIDE.md documents sidebar-based specification management",
      "GUIDE.md has section on adding columns via toolbar button",
      "GUIDE.md has section on editing specification names",
      "guided-tour.ts uses [data-tour] selectors not .fortune-sheet-* selectors",
      "Tour steps reference current UI components and workflow",
      "Tour completes without errors highlighting missing elements",
      "npm run test passes for guided-tour tests"
    ],
    "passes": true
  },
  {
    "id": "spec-value-sku-reactivity",
    "category": "Bug Fix",
    "description": "SKU does not reactively update when spec value's skuFragment is edited. When editing a spec value's SKU fragment in the sidebar (e.g., changing 'COT' to 'COT-updated'), all SKUs in the spreadsheet that use that value should automatically regenerate. Currently the SKU remains stale showing the old fragment.",
    "stepsToVerify": [
      "Add a row with spec values selected (e.g., Red, Small, Cotton generating R-S-COT)",
      "In sidebar, edit Cotton's SKU fragment from 'COT' to 'COT-NEW'",
      "SKU in spreadsheet immediately updates to 'R-S-COT-NEW'",
      "Works for all rows that contain the edited spec value",
      "Works across all sheets that have columns using that spec",
      "Undo/redo properly handles the SKU regeneration",
      "npm run typecheck passes"
    ],
    "passes": true
  },
  {
    "id": "remotion-setup",
    "category": "Remotion Video",
    "description": "Set up Remotion alongside the existing Vite project. Install dependencies (remotion, @remotion/cli, @remotion/transitions, @remotion/tailwind). Create remotion.config.ts with Tailwind support. Create remotion/index.ts entry point and remotion/Root.tsx composition registration. Add npm scripts for development and rendering.",
    "stepsToVerify": [
      "package.json contains remotion, @remotion/cli, @remotion/transitions dependencies",
      "remotion.config.ts exists with Tailwind configuration",
      "remotion/index.ts exists with registerRoot call",
      "remotion/Root.tsx exists with SKUDemo composition registered",
      "package.json has 'remotion:dev' script: 'remotion studio remotion/index.ts'",
      "package.json has 'remotion:build' script for rendering",
      "npm run remotion:dev opens Remotion Studio without errors"
    ],
    "passes": true
  },
  {
    "id": "remotion-animation-utils",
    "category": "Remotion Video",
    "description": "Create reusable animation utilities and foundation components. Create remotion/utils/animations.ts with fadeIn, slideIn, springScale, typewriter helpers. Create AnimatedText.tsx for fade/slide text, TypewriterText.tsx for character reveal, and FeatureHighlight.tsx for spotlight/callout effects.",
    "stepsToVerify": [
      "remotion/utils/animations.ts exports fadeIn, slideIn, springScale, typewriter functions",
      "remotion/components/AnimatedText.tsx renders text with fade and slide animations",
      "remotion/components/TypewriterText.tsx reveals text character-by-character",
      "remotion/components/FeatureHighlight.tsx renders animated spotlight/callout box",
      "All animations use useCurrentFrame() not CSS transitions",
      "npm run typecheck passes"
    ],
    "passes": true
  },
  {
    "id": "remotion-mockup-components",
    "category": "Remotion Video",
    "description": "Create mockup components that visually match the SKU Generator app. Create AppFrame.tsx (browser chrome), MockSidebar.tsx, MockSpecCard.tsx (expandable), MockSpreadsheet.tsx (grid with cells), MockSheetTabs.tsx, MockSettingsDialog.tsx, and MockValidationPanel.tsx. Use same Tailwind classes and shadcn/ui styling as the main app.",
    "stepsToVerify": [
      "remotion/components/AppFrame.tsx renders browser window frame with title bar",
      "remotion/components/MockSidebar.tsx renders sidebar with spec cards matching app style",
      "remotion/components/MockSpecCard.tsx has expandable animation driven by frame",
      "remotion/components/MockSpreadsheet.tsx renders grid with SKU and spec columns",
      "remotion/components/MockSheetTabs.tsx renders tab bar matching app style",
      "remotion/components/MockSettingsDialog.tsx renders settings modal with delimiter options",
      "remotion/components/MockValidationPanel.tsx renders error panel with items",
      "All components use Tailwind classes consistent with main app"
    ],
    "passes": true
  },
  {
    "id": "remotion-intro-scene",
    "category": "Remotion Video",
    "description": "Create IntroScene.tsx (~4 seconds, 120 frames at 30fps). Animate app logo with spring scale from 0 to 1. Display title 'SKU Generator' with typewriter effect. Fade in tagline after title completes. Use subtle background gradient.",
    "stepsToVerify": [
      "remotion/scenes/IntroScene.tsx exports IntroScene component",
      "Logo animates with spring scale (damping: 15 for slight bounce)",
      "Title 'SKU Generator' appears character-by-character",
      "Tagline fades in with upward slide after title",
      "Scene duration is approximately 120 frames",
      "Visual style matches app branding"
    ],
    "passes": true
  },
  {
    "id": "remotion-spec-management-scene",
    "category": "Remotion Video",
    "description": "Create SpecManagementScene.tsx (~7 seconds, 210 frames). Show sidebar sliding in from left with spring animation. Animate spec cards appearing with staggered fade-in. Show card expansion animation. Simulate drag-to-reorder with ghost card moving and other cards shifting.",
    "stepsToVerify": [
      "remotion/scenes/SpecManagementScene.tsx exports SpecManagementScene component",
      "Sidebar slides in from left using spring animation",
      "Spec cards (Color, Size, Material) appear with staggered timing",
      "One card expands to show values with height animation",
      "Drag reorder simulation shows card moving and others shifting",
      "SKU fragment badges are highlighted during expansion"
    ],
    "passes": true
  },
  {
    "id": "remotion-spreadsheet-scene",
    "category": "Remotion Video",
    "description": "Create SpreadsheetScene.tsx (~10 seconds, 300 frames). Show browser frame sliding in. Animate cell selection with ring highlight. Show dropdown opening with height animation and options appearing. Animate value selection and dropdown closing. Show SKU auto-generation with character-by-character fill in Column A. Demonstrate multiple rows with staggered updates.",
    "stepsToVerify": [
      "remotion/scenes/SpreadsheetScene.tsx exports SpreadsheetScene component",
      "Browser frame enters with slide animation",
      "Cell selection shows animated ring around cell",
      "Dropdown opens with spring height animation",
      "Value selection highlights option before closing",
      "SKU in Column A fills character-by-character with typing cursor",
      "Multiple rows show different SKU combinations"
    ],
    "passes": true
  },
  {
    "id": "remotion-settings-scene",
    "category": "Remotion Video",
    "description": "Create SettingsScene.tsx (~4 seconds, 120 frames). Show settings dialog scaling in from center with spring animation. Highlight delimiter options with spotlight effect. Animate button state change when selecting new delimiter. Show all visible SKUs updating simultaneously with flash effect.",
    "stepsToVerify": [
      "remotion/scenes/SettingsScene.tsx exports SettingsScene component",
      "Dialog appears with spring scale from center",
      "Delimiter options are highlighted with spotlight",
      "Button click shows state change animation",
      "SKU cascade update shows all SKUs changing with flash",
      "New SKU format reflects changed delimiter"
    ],
    "passes": true
  },
  {
    "id": "remotion-validation-scene",
    "category": "Remotion Video",
    "description": "Create ValidationScene.tsx (~5 seconds, 150 frames). Show sheet tabs area with zoom focus. Animate tab click and sheet switch. Show validation panel sliding up from bottom. Error list items fade in sequentially. Demonstrate click-to-navigate animation from error to cell.",
    "stepsToVerify": [
      "remotion/scenes/ValidationScene.tsx exports ValidationScene component",
      "Sheet tabs area receives focus with zoom",
      "Tab click shows cursor and tab switches",
      "Validation panel slides up from bottom",
      "Error items appear with staggered fade-in",
      "Navigate animation shows cursor moving from error to cell"
    ],
    "passes": true
  },
  {
    "id": "remotion-outro-scene",
    "category": "Remotion Video",
    "description": "Create OutroScene.tsx (~2.5 seconds, 75 frames). Feature bullet list slides in from right with staggered timing. CTA text 'Try it now' animates with scale and glow effect. App logo fades back in at corner position.",
    "stepsToVerify": [
      "remotion/scenes/OutroScene.tsx exports OutroScene component",
      "Feature bullets slide in from right with stagger",
      "CTA text has scale animation with glow effect",
      "Logo fades in at corner",
      "Scene provides clear call-to-action"
    ],
    "passes": true
  },
  {
    "id": "remotion-main-composition",
    "category": "Remotion Video",
    "description": "Create SKUDemo.tsx main composition assembling all scenes. Use TransitionSeries for smooth scene transitions (fade, slide). Configure proper timing for each scene. Total duration ~35 seconds (1050 frames at 30fps). Register composition in Root.tsx with 1920x1080 resolution.",
    "stepsToVerify": [
      "remotion/compositions/SKUDemo.tsx exports SKUDemo component",
      "All 6 scenes are imported and sequenced",
      "TransitionSeries used with fade/slide transitions between scenes",
      "Total duration is approximately 1050 frames",
      "Root.tsx registers SKUDemo with 1920x1080 resolution and 30fps",
      "Full video plays through all scenes in Remotion Studio",
      "Transitions are smooth with no visual glitches"
    ],
    "passes": true
  },
  {
    "id": "remotion-render-output",
    "category": "Remotion Video",
    "description": "Render final video and verify quality. Run npm run remotion:build to generate MP4. Verify video is ~35 seconds, 1920x1080, plays smoothly. All animations render correctly. Scene transitions are seamless.",
    "stepsToVerify": [
      "npm run remotion:build completes without errors",
      "Output file out/sku-demo.mp4 exists",
      "Video duration is approximately 35 seconds",
      "Video resolution is 1920x1080",
      "All animations render as expected (no frame drops)",
      "Scene transitions play smoothly",
      "Video file size is reasonable for quality"
    ],
    "passes": false
  }
]
